#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
data.aws_ami.ami: Reading...
aws_vpc.vpc: Refreshing state... [id=vpc-02da74a7847ceb0c7]
data.aws_ami.ami: Read complete after 0s [id=ami-0fe472d8a85bc7b0e]
aws_internet_gateway.gw: Refreshing state... [id=igw-07734fbeebb78c76b]
aws_subnet.subnet: Refreshing state... [id=subnet-0244ce4e6b4adc9a2]
aws_security_group.main: Refreshing state... [id=sg-07de044a85f8e05b5]
aws_route.internet_in: Refreshing state... [id=r-rtb-04e4c421e9002a5e61080289494]
aws_security_group_rule.public_in_ssh: Refreshing state... [id=sgrule-1555607193]
aws_security_group_rule.public_out: Refreshing state... [id=sgrule-1330706134]
aws_instance.instance: Refreshing state... [id=i-011faba7aa0db7648]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_user.iam_user will be created
  + resource "aws_iam_user" "iam_user" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "user"
      + path          = "/"
      + tags_all      = (known after apply)
      + unique_id     = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @ashishjullia, Action: `pull_request`*